PROGRAM EXAMPLE0.
BEGIN *> un comentario
      * MOVE 2 * (1 + 4) TO V1.
      MOVE 2 * (1 + 4) TO V1.
      ADD 1 TO V1.
      SUBTRACT 2 * (1 + 4) FROM V1.
      ACCEPT V1.
      DISPLAY V1.
      DISPLAY 2.34e-10.
      DISPLAY "My age is ", 45, ", and my weight is ", 63.5, " Kgs".
      IF VAR1 IS GREATER THAN 0 THEN DISPLAY VTHEN. ELSE DISPLAY VELSE. END.
      IF VAR1 IS NOT LESS THAN 0 THEN DISPLAY 1. ELSE IF VAR2 IS EQUAL TO 0 THEN DISPLAY 2. ELSE DISPLAY 666. END. END.
      VARYING VAR FROM 1 TO 20 BY 2 DO DISPLAY VAR. END.
      MOVE 10 + 2 TO F. VARYING VAR FROM F TO 20 DO DISPLAY VAR. END.
      MOVE 10 TO V. WHILE V IS NOT GREATER THAN 0 DO DISPLAY V. SUBTRACT 1 FROM V. END.
END.
